src/ex_Tabakon/Documents/ТБКИнкасация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБКИнкасация</Name>
			<Comment>ТБКИнкассация</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКСдаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСдаваемыхНаличных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейИнкасации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленВУТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>199</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЧекаККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СменаЗакрыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробиватьЧекиПоКассеККМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПробитЧек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтчетОРозничныхПродажах</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБКИнкасация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.ДатаПоследнейИнкасации	=	ПолучитьДатуПоследнейИнкасации();  
		
		Объект.Продавец	=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца();;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.ДатаПоследнейИнкасации) тогда   
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Истина;
	иначе
    	Элементы.ДатаПоследнейИнкасации.Доступность	=	Ложь;
		
		Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
	КонецЕсли;   
	
	  
	Если РольДоступна("ПолныеПрава") тогда
		Элементы.ОтправленВУТ.Видимость	=Истина;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
 	ИспользоватьПодключаемоеОборудование	= Истина;	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");

	Если ЗначениеЗаполнено(Объект.Экспедитор) тогда
		ЭтаФорма.ТолькоПросмотр	=	Истина;
	КонецЕсли;  
	
	
	Если Параметры.Ключ.Пустая() тогда
		Объект.Экспедитор					=	""; 
		Объект.СуммаСдаваемыхНаличных		=	0; 

		Объект.Продавец		=	ОбщегоНазначенияВызовСервера.ПолучитьТекущегоПродавца(); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Отказ = Ложь;
	Если не Объект.Экспедитор.Пустая() тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Экспедитор проставлен";
		Сообщение.Поле = "Экспедитор";
		Сообщение.УстановитьДанные(Объект.Экспедитор);
		Сообщение.Сообщить(); 
		Возврат;	
	КонецЕсли;
	
	Если (Событие = "Штрихкод" Или Событие = "ПолученШтрихкод")  Тогда
		ДанныеСоСканераСтруктура = СобытияФормИСКлиент.ВнешнееСобытиеПреобразоватьДанныеСоСканераВСтруктуру(
			ЭтотОбъект, 
			Источник, 
			Событие, 
			Данные);
			                               
		Если ДанныеСоСканераСтруктура = Неопределено Тогда
			Возврат;
		КонецЕсли;

		ДанныеСоСканераСтруктура.Штрихкод = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ДанныеСоСканераСтруктура.Штрихкод);
		ДанныеСоСканераСтруктура.Штрихкод = СокрЛ(ДанныеСоСканераСтруктура.Штрихкод);
		
		Если Найти(ДанныеСоСканераСтруктура.Штрихкод,"FL_") тогда
			
			НаименованиеКод		= Сред(ДанныеСоСканераСтруктура.Штрихкод,4);//отрезаем FL_			
			Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			
			//2024-04-03
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		= Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//отрезаем пароль
				Объект.Экспедитор	= ПроставитьЭкспедитора(НаименованиеКод);
			КонецЕсли;
			
			Если Объект.Экспедитор.Пустая() тогда
				НаименованиеКод		=   Сред(ДанныеСоСканераСтруктура.Штрихкод,4);
				НаименованиеКод		=	Сред(НаименованиеКод,1,СтрДлина(НаименованиеКод)-4);//убираем пароль если это новый куар
				Объект.Экспедитор	=	ПроставитьЭкспедитора(НаименованиеКод);

				Если Объект.Экспедитор.Пустая() тогда
					Сообщить("Не найден экспедитор! " + НаименованиеКод);
					Возврат;
				КонецЕсли;
			КонецЕсли;
			
			Записать();
			Возврат;
		КонецЕсли;
		
	Иначе
		ПодключаемоеОборудованиеРТКлиент.ВнешнееСобытиеОборудования(ЭтотОбъект, Источник, Событие, Данные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДатаПоследнейИнкасацииПриИзменении(Элемент)   
	Объект.СуммаКСдаче	=	ПолучитьСуммуКСдаче(Объект.ДатаПоследнейИнкасации);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПроставитьЭкспедитора(НаименованиеСпр)         
	//разборНаименования
	НужНаим	=	"";
	Пока НаименованиеСпр <> "" цикл
		Если Лев(НаименованиеСпр,2) = "32" тогда
			НужНаим		=	НужНаим  + " ";	 
			НаименованиеСпр	=	Сред(НаименованиеСпр,3); 
			Продолжить;
		КонецЕсли;
		
		КодСимвола	=	Сред(НаименованиеСпр,1,4);
		НужНаим		=	НужНаим + Символ(КодСимвола);
		
		НаименованиеСпр	=	Сред(НаименованиеСпр,5);
	КонецЦикла;  
	
	Если НужНаим = "" тогда Возврат Неопределено КонецЕсли;
	
	Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию(НужНаим);	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоследнейИнкасации()
	Запрос	=	Новый запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	 	             |	ТБКИнкасация.Дата КАК Дата
	      	 	             |ИЗ
	      	 	             |	Документ.ТБКИнкасация КАК ТБКИнкасация
	      	 	             |ГДЕ
	      	 	             |	НЕ ТБКИнкасация.ПометкаУдаления
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	Дата УБЫВ"); 
	
	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.Дата;
	КонецЕсли;
	

КонецФункции    

&НаСервереБезКонтекста
Функция ПолучитьСуммуКСдаче(ДатаПоследнейИнкасации)  
	Если Не ЗначениеЗаполнено(ДатаПоследнейИнкасации) тогда Возврат 0 КонецЕсли;
	
	Запрос	=	Новый запрос("ВЫБРАТЬ
	      	 	             |	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
	      	 	             |ПОМЕСТИТЬ Итог
	      	 	             |ИЗ
	      	 	             |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	ПриходныйКассовыйОрдер.Проведен
	      	 	             |	И ПриходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |
	      	 	             |ОБЪЕДИНИТЬ ВСЕ
	      	 	             |
	      	 	             |ВЫБРАТЬ
	      	 	             |	-РасходныйКассовыйОрдер.СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	      	 	             |ГДЕ
	      	 	             |	РасходныйКассовыйОрдер.Проведен
	      	 	             |	И РасходныйКассовыйОрдер.Дата МЕЖДУ &ДатаНач И &ДатаКон
	      	 	             |;
	      	 	             |
	      	 	             |////////////////////////////////////////////////////////////////////////////////
	      	 	             |ВЫБРАТЬ
	      	 	             |	СУММА(Итог.СуммаДокумента) КАК СуммаДокумента
	      	 	             |ИЗ
	      	 	             |	Итог КАК Итог");

	Запрос.УстановитьПараметр("ДатаКон", Началодня(ТекущаяДата())-1 );	
	Запрос.УстановитьПараметр("ДатаНач", ДатаПоследнейИнкасации);

	Рез = запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() тогда
		Возврат Рез.СуммаДокумента;
	КонецЕсли;
	

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Параметры.Ключ.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Экспедитор) и ЗначениеЗаполнено(Объект.СуммаСдаваемыхНаличных) тогда	
			ЗаписатьНаСервере();
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры 

&НаСервере
Процедура ЗаписатьНаСервере();
	Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
КонецПроцедуры
